Use titanic dataset. Handle the null values and convert the categorical values into numerical values. Make a classification model using Logistic Regression to predict the survival of a passenger on the ship.

In [3]:
import numpy as np
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score

In [4]:
#importing the titanic dataset
titanic_df=pd.read_csv('https://raw.githubusercontent.com/kajalpanda1/DatasetRepository/master/Titanic.csv')

In [5]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [6]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156 entries, 0 to 155
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  156 non-null    int64
 1   Survived     156 non-null    int64
 2   Pclass       156 non-null    int64
 3   Name         156 non-null    object
 4   Sex          156 non-null    object
 5   Age          126 non-null    float64
 6   SibSp        156 non-null    int64
 7   Parch        156 non-null    int64
 8   Ticket       156 non-null    object
 9   Fare         156 non-null    float64
 10  Cabin        31 non-null     object
 11  Embarked     155 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 14.8+ KB

In [7]:
titanic_df.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   156.000000  156.000000  156.000000  ...  156.000000  156.000000  156.000000
mean     78.500000    0.346154    2.423077  ...    0.615385    0.397436   28.109587
std      45.177428    0.477275    0.795459  ...    1.056235    0.870146   39.401047
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    6.750000
25%      39.750000    0.000000    2.000000  ...    0.000000    0.000000    8.003150
50%      78.500000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     117.250000    1.000000    3.000000  ...    1.000000    0.000000   30.371850
max     156.000000    1.000000    3.000000  ...    5.000000    5.000000  263.000000

[8 rows x 7 columns]

In [8]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [9]:
titanic_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age             30
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          125
Embarked         1
dtype: int64

In [10]:
titanic_df=titanic_df.drop(columns=['PassengerId','Ticket','Fare','Cabin'])

In [11]:
titanic_df.columns

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch',
       'Embarked'],
      dtype='object')

In [12]:
#filling null values for Age feature column
titanic_df['Age']=titanic_df['Age'].fillna(titanic_df['Age'].median())

In [13]:
#filling null values for Embarked feature column
titanic_df['Embarked']=titanic_df['Embarked'].fillna('ffill')

In [14]:
#adding FamilySize feature column
titanic_df['FamilySize']=titanic_df['SibSp']+titanic_df['Parch']+1

In [15]:
titanic_df.head()

   Survived  Pclass  ... Embarked FamilySize
0         0       3  ...        S          2
1         1       1  ...        C          2
2         1       3  ...        S          1
3         1       1  ...        S          2
4         0       3  ...        S          1

[5 rows x 9 columns]

In [16]:
#converting category values into numerical values
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
titanic_df['Embarked']=le.fit_transform(titanic_df['Embarked'])
titanic_df['Sex']=le.fit_transform(titanic_df['Sex'])

In [17]:
titanic_df['Title']=titanic_df['Name'].str.extract('([A-Za-z]+)\.',expand=False)
titanic_df=titanic_df.drop(columns='Name')

In [18]:
titanic_df['Title']=le.fit_transform(titanic_df['Title'])

In [19]:
#extracting independent and dependent variables from the dataset
features_df=titanic_df.iloc[:,1:].values
target_df=titanic_df.iloc[:,0].values

In [21]:
features_df.shape

(156, 8)

In [22]:
target_df.shape

(156,)

In [23]:
#standardizing features dataframe 
from sklearn.preprocessing import StandardScaler
norm=StandardScaler()
features_df=norm.fit_transform(features_df)

In [24]:
#splitting dataset into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(features_df,target_df,test_size=0.25,random_state=10)

In [25]:
#using training set to create a logistic regression model
titanic_logr=LogisticRegression(solver='liblinear',C=0.001,random_state=10)
titanic_logr.fit(X_train, y_train)

LogisticRegression(C=0.001, class_weight=None, dual=False, fit_intercept=True,
                   intercept_scaling=1, l1_ratio=None, max_iter=100,
                   multi_class='auto', n_jobs=None, penalty='l2',
                   random_state=10, solver='liblinear', tol=0.0001, verbose=0,
                   warm_start=False)

In [26]:
y_pred=titanic_logr.predict(X_test)

In [28]:
print("Training Score:  ",round(titanic_logr.score(X_train, y_train)*100,4))
print("Testing Score: ",round(titanic_logr.score(X_test, y_test)*100,4))

Training Score:   80.3419
Testing Score:  82.0513